# BuiltInFailures.RebarShapeFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures Class
BuiltInFailures Class Members See Also
---
Failures about RebarShape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RebarShapeFailures
```

Visual Basic
---
```text
Public NotInheritable Class RebarShapeFailures
```

Visual C++
---
```text
public ref class RebarShapeFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RebarShapeFailures
# See Also
BuiltInFailures..::..RebarShapeFailures Members
Autodesk.Revit.DB Namespace